import { stationInfo } from "./StationInfo";

export type LineId =
  | "1001" // 1호선
  | "1002" // 2호선
  | "1003" // 3호선
  | "1004" // 4호선
  | "1005" // 5호선
  | "1006" // 6호선
  | "1007" // 7호선
  | "1008" // 8호선
  | "1009" // 9호선
  | "1063" // 경의중앙선
  | "1065" // 공항철도
  | "1067" // 경춘선
  | "1075" // 수인분당선
  | "1077" // 신분당선
  | "1078" // 의정부경전철
  | "1079" // 우이신설선
  | "1081" // 경강선
  | "1082"; // 서해선

export const lineStore = {
  "1007": [
    "장암",
    "도봉산",
    "수락산",
    "마들",
    "노원",
    "중계",
    "하계",
    "공릉",
    "태릉입구",
    "먹골",
    "중화",
    "상봉",
    "면목",
    "사가정",
    "용마산",
    "중곡",
    "군자",
    "어린이대공원",
    "건대입구",
    "뚝섬유원지",
    "청담",
    "강남구청",
    "학동",
    "논현",
    "반포",
    "고속터미널",
    "내방",
    "총신대입구",
    "남성",
    "숭실대입구",
    "상도",
    "장승배기",
    "신대방삼거리",
    "보라매",
    "신풍",
    "대림",
    "남구로",
    "가산디지털단지",
    "철산",
    "광명사거리",
    "천왕",
    "온수",
    "까치울",
    "부천종합운동장",
    "춘의",
    "신중동",
    "부천시청",
    "상동",
    "삼산체육관",
    "굴포천",
    "부평구청",
    "산곡",
    "석남",
  ],
};

export const lineName = {
  "7호선": "1007",
};

/** 1호선 */

const 경인선 = [
  "인천",
  "동인천",
  "도원",
  "제물포",
  "도화",
  "주안",
  "간석",
  "동암",
  "백운",
  "부평",
  "부개",
  "송내",
  "중동",
  "부천",
  "소사",
  "역곡",
  "온수",
  "오류동",
  "개봉",
  "구일",
  //아래는 경인선이 아님
  // "구로",
  // "신도림",
  // "영등포",
  // "신길",
  // "대방",
  // "노량진",
  // "용산",
  // "남영",
  // "서울",
];

const 경부선 = [
  "신창",
  "온양온천",
  "배방",
  "탕정",
  "아산",
  "쌍용",
  "봉명",
  "천안",
  "두정",
  "직산",
  "성환",
  "평택",
  "평택지제",
  "서정리",
  "송탄",
  "진위",
  "오산",
  "오산대",
  "세마",
  "서동탄",
  "병점",
  "세류",
  "수원",
  "화서",
  "성균관대",
  "의왕",
  "당정",
  "군포",
  "금정",
  "명학",
  "안양",
  "관악",
  "석수",
  "금천구청",
  // "광명",
  "독산",
  "가산디지털단지",
  // "구로",
  // "신도림",
  // "영등포",
  // "신길",
  // "대방",
  // "노량진",
  // "용산",
  // "남영",
  // "서울",
];

const 경부선2 = [
  "구로",
  "신도림",
  "영등포",
  "신길",
  "대방",
  "노량진",
  "용산",
  "남영",
  "서울",
];

const 경원선 = [
  "청량리",
  "회기",
  "외대앞",
  "신이문",
  "석계",
  "광운대",
  "월계",
  "녹천",
  "창동",
  "방학",
  "도봉",
  "도봉산",
  "망월사",
  "회룡",
  "의정부",
  "가능",
  "녹양",
  "양주",
  "덕계",
  "덕정",
  "지행",
  "동두천중앙",
  "보산",
  "동두천",
  "소요산",
];

const 수도권_광역철도_1호선 = [
  "시청",
  "종각",
  "종로3가",
  "종로5가",
  "동대문",
  "동묘앞",
  "신설동",
  "제기동",
];

export const 인천_소요산 = [
  ...경인선,
  ...경부선2,
  ...수도권_광역철도_1호선,
  ...경원선,
];

export const 신창_소요산 = [
  ...경부선,
  ...경부선2,
  ...수도권_광역철도_1호선,
  ...경원선,
];

/** 7호선 */

const 석남_장암 = [
  "석남",
  "산곡",
  "부평구청",
  "굴포천",
  "삼산체육관",
  "상동",
  "부천시청",
  "신중동",
  "춘의",
  "부천종합운동장",
  "까치울",
  "온수",
  "천왕",
  "광명사거리",
  "철산",
  "가산디지털단지",
  "남구로",
  "대림",
  "신풍",
  "보라매",
  "신대방삼거리",
  "장승배기",
  "상도",
  "숭실대입구",
  "남성",
  "총신대입구",
  "내방",
  "고속터미널",
  "반포",
  "논현",
  "학동",
  "강남구청",
  "청담",
  "뚝섬유원지",
  "건대입구",
  "어린이대공원",
  "군자",
  "중곡",
  "용마산",
  "사가정",
  "면목",
  "상봉",
  "중화",
  "먹골",
  "태릉입구",
  "공릉",
  "하계",
  "중계",
  "노원",
  "마들",
  "수락산",
  "도봉산",
  "장암",
];

/** 종점이 바뀌면 변수 명이 바뀌어야 함 */
export const routeStore: Record<LineId, Record<string, string[]>> = {
  "1001": { 인천: 인천_소요산, 신창: 신창_소요산 },
  "1002": { 성수: [], 까치산: [], 신설동: [] },
  "1003": { 대화: [] },
  "1004": { 오이도: [] },
  "1005": { 하남검단산: [], 마천: [] },
  "1006": { 신내: [] },
  "1007": { 석남: 석남_장암 },
  "1008": { 모란: [] },
  "1009": { 개화: [] },
  "1063": {},
  "1065": {},
  "1067": {},
  "1075": {},
  "1077": {},
  "1078": {},
  "1079": {},
  "1081": {},
  "1082": {},
};

const result = 경원선.map((station) => {
  const arr = Object.entries(stationInfo);
  const index = arr.findIndex(
    ([key, item]) => item.line_num === "1호선" && item.station_nm === station
  );
  const [key, value] = arr[index];

  return { station_nm: value.station_nm, station_id: key };
});

// console.log(result);

// console.log(result);
// console.log("----------------");
// console.log(
//   Object.entries(stationInfo)
//     .map(([key, value]) => {
//       return `('${key}', '${value.station_nm}', '1001', ${value.coordinate.lat}, ${value.coordinate.lng}),`;
//     })
//     .join("")
//     .replaceAll(/\"/g, "")
// );

// LINE

// id   line_name   line_case(FK)
// 1   1호선      1(인천 - 구로)
// 2   1호선      2(구로 - 소요산)
// 3   1호선      3(신창 - 구로)

// =================================================================

// LINECASE_1 LINECASE_2 LINECASE_3

// line_case   station_name id order
// 1   인천                     1
// 1   동인천                   2
// 1   도원                     3
// ...   ...
// n   구로

// ==================================================================
